{
  "id": "cucumber",
  "name": "Огурец",
  "variant": "vegetable",
  "preview": "https://cdn-icons-png.flaticon.com/512/7119/7119784.png",
  "description": "Огурцы - это овощ теплого сезона, высаживаемый на открытом воздухе в грунт не ранее, чем через 2 недели после даты последних весенних заморозков. Большинство сортов будут расти на любом пространстве, благодаря способности растения карабкаться. Наиболее распространенные сорта нарезанных огурцов имеют раскидистые виноградные лозы с большими зелеными листьями и вьющимися усиками. Рост этих растений быстрый, а урожайность обильная, если вы правильно за ними ухаживаете.",
  "gallery": [
    "https://sad-i-ogorod.ru/upload/iblock/6ac/lch1iny86m637azpfzjtpfp9d34kymok.jpg",
    "https://eda.ru/img/eda/c464x302/s1.eda.ru/StaticContent/Photos/120131082618/120329191315/p_O.jpg",
    "https://static.toiimg.com/photo/95536253.cms"
  ],
  "quickInfo": [
    {
      "type": "DEPTH",
      "value": "1 см",
      "description": "Посадите семена огурца на глубину 1 см. Температура и уровень влажности на верхнем дюйме почвы могут сильно варьироваться, поэтому глубина посадки имеет значение!"
    },
    {
      "type": "SUN",
      "value": "Полное солнце",
      "description": "Огурцы лучше всего растут на полном солнце"
    },
    {
      "type": "WATER",
      "value": "1 см/неделя",
      "description": "Когда появятся всходы, начинайте часто поливать и увеличивайте до 3 литров в неделю после образования плодов. Поливайте последовательно; погрузите палец в почву, и когда она высохнет выше первого сустава вашего пальца, пришло время поливать. Непоследовательный полив приводит к тому, что плоды становятся горькими на вкус. Поливайте медленно утром или в начале дня, избегая попадания на листья."
    },
    {
      "type": "SEASON",
      "value": "Теплый",
      "description": "Огурцы будут хорошо расти в теплую погоду."
    },
    {
      "type": "FROST",
      "value": "Не переносит"
    },
    {
      "type": "GERMINATION",
      "value": "3-10 дней",
      "description": "После посадки семенам огурца требуется от 3 до 10 дней, чтобы прорасти"
    },
    {
      "type": "SPROUT_TO_HARVEST",
      "value": "8 недель",
      "description": " Требуется 8 недель, чтобы огурец был готов к сбору урожая после появления всходов. Если вы купите саженцы, то сможете собрать урожай раньше."
    }
  ],
  "neighbors": {
    "companion": [
      {
        "id": "cabbage",
        "name": "Капуста",
        "preview": "https://cdn-icons-png.flaticon.com/512/8856/8856299.png"
      },
      {
        "id": "tomatoes",
        "name": "Помидор",
        "preview": "https://cdn-icons-png.flaticon.com/512/199/199620.png"
      }
    ],
    "combative": [
      {
        "id": "potatoes",
        "name": "Картофель",
        "preview": "https://cdn-icons-png.flaticon.com/512/1652/1652077.png"
      },
      {
        "id": "pumpkin",
        "name": "Тыква",
        "preview": "https://cdn-icons-png.flaticon.com/512/6135/6135880.png"
      }
    ]
  },
  "fullInfo": [
    {
      "title": "Выращивание",
      "description": "Огурцы обычно не рекомендуются для пересадки, так как у них чувствительные корни. Однако это можно сделать. Начинайте пересадку в помещении за 2-3 недели до посадки. Растения огурцов легко повреждаются морозом, поэтому обязательно подождите около 2 недель после даты последнего заморозка, чтобы высадить их в саду."
    },
    {
      "title": "Рекомендации по посадке",
      "description": "Решетка может быть хорошей идеей, если вы хотите, чтобы виноградная лоза взбиралась вверх, или если у вас ограниченное пространство. Решетка также защищает плоды от повреждений, вызванных лежанием на влажной земле."
    },
    {
      "title": "Кормление",
      "description": "Если вы внесли органические вещества в почву перед посадкой, возможно, вам потребуется только подкормить растения компостом. Или, если хотите, используйте удобрение из вашего садового магазина с низким содержанием азота, но высоким содержанием калия и фосфора. Вносите жидкое удобрение непосредственно в почву вокруг растений при посадке, через 1 неделю после цветения и каждые 3 недели. Или же вы можете внести в почву гранулированное удобрение. Не переусердствуйте с удобрениями, иначе плоды станут низкорослыми."
    },
    {
      "title": "Сбор урожая",
      "description": "Собирают урожай, срезая или прищипывая у основания плода. Огурцы лучше всего собирать до того, как их семена станут твердыми, и употреблять в пищу незрелыми. Не позволяйте им пожелтеть. Огурец считается самым качественным, когда он равномерно зеленый, твердый и хрустящий. В разгар сбора урожая вы должны собирать огурцы каждые пару дней. Держите их собранными. Если вы этого не сделаете, то по мере созревания растений они перестанут плодоносить."
    },
    {
      "title": "Место хранения",
      "description": "Огурцы более чем на 90 процентов состоят из воды. Храните их плотно завернутыми в пластик, чтобы сохранить влажность. При правильном хранении в холодильнике они будут храниться от недели до 10 дней. Конечно, некоторые сорта можно мариновать."
    }
  ]
}
