export const content = [
  {
    _id: '123',
    title: 'Как обрабатывать плодовый сад без химии. Программа биозащиты с апреля по октябрь',
    preview: 'https://img.7dach.ru/image/1200/44/42/48/2019/03/27/f515e1-nomark.jpg',
  },
  {
    _id: '456',
    title: '9 способов полезного использования пластмассовых ящиков на даче',
    preview: 'https://img.7dach.ru/image/1200/00/00/71/2020/04/30/595bf3fa06.jpg',
  },
  {
    _id: '789',
    title: 'Основные вредители плодового сада и сроки обработки против них',
    preview: 'https://img.7dach.ru/image/1200/44/42/48/2021/05/04/73acb2-nomark.jpg',
  },
];
